app/controllers/services_controller.rb

    def show
        @service = Service.find(params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]