app/controllers/sessions_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."email" = ? LIMIT ?  [["email", "lois@lane.com"], ["LIMIT", 1]]
---
  def create
    @client = Client.find_by(email: params[:client][:email])

INSERT INTO "clients" ("name", "email", "password_digest", "created_at", "updated_at", "image", "uid") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "clients".* FROM "clients" WHERE "clients"."uid" = ? LIMIT ?  [["uid", "641791256233983"], ["LIMIT", 1]]
---
  def omniauth_create
      if auth['uid']
      @client = Client.find_or_create_by(uid: auth['uid']) do |client|