app/controllers/staffs_controller.rb

INSERT INTO "staffs" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Beyonce"], ["bio", "My nails are great"], ["created_at", "2019-05-24 17:37:26.538628"], ["updated_at", "2019-05-24 17:37:26.538628"]]
---
  def create
    @staff = Staff.new(staff_params)
    if @staff.save

SELECT "staffs".* FROM "staffs"
---
  def meet
    @staffs = Staff.all

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @staff = Staff.find(params[:id])